---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachmentOffsetParam
source: html/5a720a82-a1cf-ea8c-ad12-bad2dd3a19e4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachmentOffsetParam Property

"Offset From Attachment At Top"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnTopAttachmentOffsetParam { get; }
```